course/AdvancedModelTheory/exercises/1/solution/week1.org
#+TITLE:  Homework 1
#+AUTHOR: Qi'ao Chen@@latex:\\@@21210160025
#+OPTIONS: toc:nil
#+LATEX_HEADER: \input{../../../../preamble-lite.tex}

#+BEGIN_exercise
Consider the structure \((\Z,+,\cdot,<)\). Show that there is a complete type \(p\in S_1(\Z)\) containing the
formula \(n<x\) for each \(n\in\Z\)
#+END_exercise

#+BEGIN_proof
Let \(\Gamma=\{n<x:n\in\Z\}\). Then \Gamma is finitely satisfiable and hence there is a complete type \(q\in S_1(\Z)\)
s.t. \(q(x)\supset\Gamma\)
#+END_proof

#+BEGIN_exercise
Let \(p\in S_1(\Z)\) be as in the previous problem, meaning that the formula \(n<x\) is in \(p(x)\) for
all \(n\in\Z\). Suppose \(M\succeq\Z\) and \(q\in S_1(M)\) is an heir of \(p\). Show that \(q(x)\) contains the
formula \(n<x\) for each \(n\in M\)
#+END_exercise

#+BEGIN_proof
If for some \(n\in M\), \(\psi(x,n):=n<x\notin q(x)\). Then \(\neg\psi(x,n)\in q(x)\) and hence there is \(n'\in\Z\)
s.t. \(\neg\psi(x,n')\in p\), which is impossible
#+END_proof

#+BEGIN_exercise
Find a first-order formula \(\varphi(x,y,z)\) equivalent to \(\exists^\infty w(xw^2+yw+z=0)\) in the structure \(\C\)
#+END_exercise

#+BEGIN_proof
Let \(\psi(x):=\forall y(y\cdot x=x)\) and let \(\varphi(x,y,z):=\psi(x)\wedge\psi(y)\wedge\psi(z)\)
#+END_proof

#+BEGIN_exercise
Let \(M=\R\setminus[0,2]\) and \(N=\R\setminus[0,1)\). From quantifier elimination in \(\DLO\), one can show
that \((M,\le)\preceq(N,\le)\preceq(\R,\le)\). It turns out that \(\tp(0/N)\) is an heir of \(\tp(0/M)\). Show
that \(\tp(0/N)\) is not a strong heir of \(\tp(0/M)\)
#+END_exercise

#+BEGIN_proof
Let \(p=\tp(0/M)\) and \(q=\tp(0/N)\). Let \(\varphi(x,y):=x>y\), then \((N,dq)\vDash\forall y(d\varphi(y)\leftrightarrow y<1)\).
But in \(M\), for any \(c\in M\), \(M\vDash x<0\not\leftrightarrow x<c\). Thus \((M,dp)\vDash\neg\exists c(\forall y(d\varphi)\leftrightarrow y<c)\).
Hence \(\tp(0/N)\) is not a strong heir of \(\tp(0/M)\)
#+END_proof
